podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/MCM_MK11D5.svd.xml
<!--
Devices using this peripheral: 
      MK11D5
      MK11DA5
      MK11D5WS
      MK12D5
      MK20D5
      MK21D5
      MK21DA5
      MK21D5WS
      MK22D5
      MKW21D5
      MKW22D5
      MKW24D5
-->
      <peripheral>
         <?sourceFile "MCM_MK11D5" ?>
         <name>MCM</name>
         <description>Core Platform Miscellaneous Control Module</description>
         <groupName>MCM</groupName>
         <headerStructName>MCM</headerStructName>
         <baseAddress>0xE0080000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "16" ?>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PLASC</name>
               <description>Crossbar Switch (AXBS) Slave Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0xF</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ASC</name>
                     <description>Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch&apos;s slave input port</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A bus slave connection to AXBS input port n is absent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A bus slave connection to AXBS input port n is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLAMC</name>
               <description>Crossbar Switch (AXBS) Master Configuration</description>
               <addressOffset>0xA</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>AMC</name>
                     <description>Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A bus master connection to AXBS input port n is absent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A bus master connection to AXBS input port n is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLACR</name>
               <description>Crossbar Switch (AXBS) Control Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ARB</name>
                     <description>Arbitration select</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Fixed-priority arbitration for the crossbar masters</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Round-robin arbitration for the crossbar masters</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
